Repository: vikdevelop/flatpak-docs
Catalog: po/*/LC_MESSAGES/first-build.po
Languages: cs

source: Building your first Flatpak
cs: Sestavení vašeho prvního Flatpaku

source: This tutorial provides a quick introduction to building Flatpaks. In it, you will learn how to create a basic Flatpak application, which can be installed and run.
cs: Tento tutoriál poskytuje rychlý úvod do vytváření Flatpaků. Dozvíte se v něm, jak vytvořit základní aplikaci Flatpak, kterou lze nainstalovat a spustit.

source: 1. Install a runtime and the matching SDK
cs: 1. Nainstalujte běhové prostředí a odpovídající SDK

source: Flatpak requires every app to specify a runtime that it uses for its basic dependencies. Each runtime has a matching SDK (Software Development Kit), which contains all the things that are in the runtime, plus headers and development tools. This SDK is required to build apps for the runtime.
cs: Flatpak vyžaduje, aby každá aplikace zadala běhové prostředí, který používá pro své základní závislosti. Každé běhové prostředí má odpovídající SDK (Software Development Kit), který obsahuje všechny věci, které jsou v runtime, ale navíc hlavičky a vývojové nástroje. Tato sada SDK je nutná k sestavení aplikací pro dané běhové prostředí.

source: 2. Create the app
cs: 2. Vytvořte aplikaci

source: The app that is going to be created for this tutorial is a simple script. To create it, copy the following::
cs: Aplikace která bude vytvořena pro tento tutoriál je jednoduchý skript. Pro vytvoření skriptu, zkopírujte následující::

source: Now paste this into an empty file and save it as ``hello.sh``.
cs: Nyní vložte toto do prázdného souboru a uložte jej jako ``hello.sh``.

source: 3. Add a manifest
cs: 3. Přidejte manifest

source: Each Flatpak is built using a manifest file which provides basic information about the application and instructions for how it is to be built. To add a manifest to the hello world app, add the following to an empty file:
cs: Každý Flatpak je sestaven pomocí souboru manifestu, který obsahuje základní informace o aplikaci a pokyny, jak má být sestavena. Chcete-li přidat manifest do aplikace hello world, přidejte do prázdného souboru následující text:

source: Now save the file alongside ``hello.sh`` and call it ``org.flatpak.Hello.yml``.
cs: Nyní uložte soubor vedle ``hello.sh`` a pojmenujte jej ``org.flatpak.Hello.yml``.

source: In a more complex application, the manifest would list multiple modules. The last one would typically be the application itself, and the earlier ones would be dependencies that are bundled with the app because they are not part of the runtime.
cs: Ve složitější aplikaci by manifest obsahoval seznam více modulů. Poslední z nich by obvykle byla samotná aplikace a ty předchozí by byly závislosti, které jsou s aplikací přibaleny, protože nejsou součástí běhového prostředí.

source: 4. Build the application
cs: 4. Sestavte aplikaci

source: Now that the app has a manifest, ``flatpak-builder`` can be used to build it. This is done by specifying the manifest file and a target directory::
cs: Nyní, když má aplikace manifest, lze k jejímu sestavení použít nástroj ``flatpak-builder``. To se provádí zadáním souboru manifestu a cílového adresáře::

source: 5. Test the build
cs: 6. Otestujte sestavení

source: To verify that the build was successful, run the following::
cs: K ověření, že sestavení proběhlo úspěšně, zadejte následující::

source: Congratulations, you've made an app!
cs: Gratulujeme, vytvořili jste aplikaci!

source: 6. Put the app in a repository
cs: 6. Přidejte aplikaci do repozitáře

source: If you want to share the application you can put it in a repository. This is done by passing the ``--repo`` argument to ``flatpak-builder``::
cs: Pokud chcete aplikaci sdílet, můžete ji přidat do repozitáře. To se provádí předáním argumentu ``--repo`` příkazu ``flatpak-builder``::

source: This does the build again, and at the end exports the result to a local directory called ``repo``. Note that ``flatpak-builder`` keeps a cache of previous builds in the ``.flatpak-builder`` subdirectory, so doing a second build like this is very fast.
cs: Znovu provede sestavení a na konci vyexportuje výsledek do místního adresáře s názvem ``repo``. Všimněte si, že ``flatpak-builder`` uchovává mezipaměť předchozích sestavení v podadresáři ``.flatpak-builder``, takže provedení druhého sestavení tímto způsobem je velmi rychlé.

source: This second time we passed in ``--force-clean``, which means that the previously created ``build-dir`` directory was deleted before the new build was started.
cs: Podruhé jsme přidali argument ``--force-clean``, což znamená, že dříve vytvořený adresář ``build-dir`` byl před spuštěním nového sestavení smazán.

source: In order for your application to show up in application stores while testing with a local repository, you might have to run ``flatpak build-update-repo repo``. For more information how to publish to application stores see `Appdata files <http://docs.flatpak.org/en/latest/freedesktop-quick-reference.html#appdata-files>`_.
cs: Aby se vaše aplikace při testování s místním repositářem zobrazila v aplikačních úložištích, budete možná muset spustit ``flatpak build-update-repo repo``. Další informace o tom, jak publikovat v aplikačních úložištích, naleznete v části `Appdata files <http://docs.flatpak.org/en/latest/freedesktop-quick-reference.html#appdata-files>`_.

source: 7. Install the app
cs: 7. Nainstalujte aplikaci

source: Now we're ready to add the repository that was just created and install the app. This is done with two commands::
cs: Nyní pokud jste připraveni přidat repozitář který byl právě vytvořen, taj nainstalujte aplikaci. K tomu slouží dva příkazy::

source: The first command adds the repository that was created in the previous step. The second command installs the app from the repository.
cs: První příkaz přidá repozitář vytvořené v předchozím kroku. Druhý příkaz nainstaluje aplikaci z repozitáře.

source: Both these commands use the ``--user`` argument, which means that the repository and the app are added per-user rather than system-wide. This is useful for testing.
cs: Oba tyto příkazy používají argument ``--user``, což znamená, že repozitář a aplikace jsou přidány pro jednotlivé uživatele, nikoli pro celý systém. To je užitečné pro testování.

source: Note that the repository was added with ``--no-gpg-verify``, since a GPG key wasn't specified when the app was built. This is fine for testing, but for official repositories you should sign them with a private GPG key.
cs: Všimněte si, že repozitář bylo přidáno s příkazem ``--no-gpg-verify``, protože při sestavování aplikace nebyl zadán klíč GPG. To je v pořádku pro testování, ale pro oficiální repozitáře byste je měli podepsat soukromým klíčem GPG.

source: 8. Run the app
cs: 8. Spusťte aplikaci

source: All that's left is to try the app. This can be done with the following command::
cs: Zbývá už jen vyzkoušet aplikaci. To lze provést pomocí následujícího příkazu::

source: This runs the app, so that it prints 'Hello world, from a sandbox'.
cs: Tím se aplikace spustí tak, že vypíše 'Hello world, from a sandbox (Ahoj světe, ze sandboxu)'.
